{
  "slogan": "Мы докажем вам, что нет ничего сложного в <br/> <strong>WEB-программировании</strong><br/> и программировании в целом.",
  "all_videos_title": "Все видео уроки",
  "test_title": "Проверьте свои знания",
  "test_description": "Здесь вы можете проверить свои знания с помощью онлайн-тестов.",
  "lessons_packages": "Пакеты уроков",
  "categoris": {
    "html": {
      "description": "Язык гипертекстовой разметки",
      "why": "Для чего нужен HTML ?",
      "full_descr": "HTML- это язык разметки гипертекста. Данный язык применяется для создания веб-страниц. Он интерпретируется (обрабатывается) браузером и отображается в виде документа в удобной для человека форме.<br/> Обучающие курсы веб программировании Webex Technologies охватывают HTML."
    },
    "css": {
      "description": "Каскадные таблицы стилей",
      "why": "Для чего нужен CSS ?",
      "full_descr": "CSS - это язык для описания стилей веб-страниц, включая цвета, расположение элементов и шрифты. Это позволяет адаптировать презентацию к различным типам устройств. С помощью CSS вы можете создавать веб-сайты с широким экраном, оптимизированные для мобильных устройств и т. д.<br/> Обучающие курсы веб программировании Webex Technologies охватывают CSS."
    },
    "boot": {
      "description": "Библиотека интерфейсных компонентов",
      "why": "Для чего нужен Bootstrap ?",
      "full_descr": "Bootstrap - это фреймворк, который поможет вам быстрее и проще создавать сайты. Он включает шаблоны дизайна на основе HTML и CSS для типографики, форм, кнопок, таблиц, навигации, модальных изображений, каруселей изображений и т.д. Большим преимуществом использования Bootstrap являются небольшой код и простота использования.<br/> Обучающие курсы веб программировании Webex Technologies охватывают Bootstrap."
    },
    "js": {
      "description": "Динамический язык программирования",
      "why": "Для чего нужен JavaScript ?",
      "full_descr": "В основном JavaScript работает на компьютерах веб-пользователей - даже когда они не в сети! JavaScript позволяет создавать высокочувствительные интерфейсы, которые улучшают пользовательский интерфейс и обеспечивают динамическую функциональность, не дожидаясь реакции сервера.<br/> Учебные курсы веб программировании Webex Technologies охватывают JavaScript."
    },
    "es6": {
      "description": "Спецификация языка сценариев (JS)",
      "why": "Для чего нужен EcmaScript ?",
      "full_descr": "Во введении спецификации ES6 перечислены все новые функции: EcmaScript включает в себя модули, объявления классов, лексическую область видимости блоков, итераторы и генераторы, обещания асинхронного программирования, шаблоны деструктуризации и правильные вызовы хвоста. Основным преимуществом является то, что все браузеры поддерживают EcmaScript код. <br/> Учебные курсы веб программировании Webex Technologies охватывают EcmaScript."
    },
    "jquery": {
      "description": "jQuery - это библиотека JavaScript",
      "why": "Для чего нужен jQuery ?",
      "full_descr": "jQuery (слоган: меньше кода) - это быстрая, небольшая и многофункциональная библиотека JavaScript. Библиотека делает такие возможности, как управление DOM деревом, обработку событий, анимацию и разработка Ajax запросов к бекенду, намного проще благодаря простому в использовании API, который работает в многих браузерах.<br/> Обучающие курсы веб программировании Webex Technologies охватывают jQuery."
    },
    "php": {
      "description": "Гипертекстовый препроцессор",
      "why": "Для чего нужен PHP ?",
      "full_descr": "PHP - это серверный язык сценариев. PHP используется для разработки статических веб-сайтов, динамических веб-сайтов или веб-приложений. PHP расшифровывается как Hypertext Pre-Processor, который ранее назывался Personal Home Pages. Сценарии PHP могут интерпретироваться только на сервере, на котором установлен PHP движок.<br/> Обучающие курсы веб программировании Webex Technologies охватывают PHP."
    },
    "mysql": {
      "description": "Система управления базами данных SQL",
      "why": "Для чего нужен MySQL ?",
      "full_descr": "MySQL - это система управления реляционными базами данных (RDBMS), разработанная Oracle на основе языка структурированных запросов (SQL). База данных - это структурированная коллекция данных. В частности, реляционная база данных - это цифровое хранилище, которое собирает данные и организует их в соответствии с реляционной моделью.<br/> Учебные курсы веб программировании Webex Technologies охватывают MySQL."
    },
    "react": {
      "description": "JS библиотека для построения П.И.",
      "why": "Для чего нужен ReactJS ?",
      "full_descr": "React позволяет разработчикам создавать большие веб-приложения, которые могут изменять данные без перезагрузки страницы. Основная цель React - быть быстрым, масштабируемым и простым. React JS является мощная библиотека веб-интерфейса, созданная Facebook-ом.<br/> Учебные курсы веб программировании Webex Technologies охватывают React JS."
    },
    "redux": {
      "description": "JS библиотека управления состоянием П.И.",
      "why": "Для чего нужен Redux ?",
      "full_descr": "Redux поддерживает хорошую архитектуру React. Хотя весь код можно написать в одной функции, обычно лучше разбить эту логику на более мелкие функции, каждая из которых выполняет определенную задачу, чтобы их было легче понять.<br/> Учебные курсы веб программировании Webex Technologies включают также библиотеку Redux."
    },
    "server": {
      "description": "Веб Сервер(домейн, хостинг)",
      "why": "Для чего нужен Веб сервер ?",
      "full_descr": "Вам нужно как доменное имя, так и веб-хостинг для создания сайта. Когда пользователь пытается получить доступ к вашему веб-сайту, введя ваш веб-адрес (доменное имя) в адресную строку браузера, доменное имя указывает на файлы, хранящиеся на веб-хостинге. Затем они могут увидеть ваш сайт в Интернете.<br/> Учебные курсы веб программировании Webex Technologies включают также Веб Сервер"
    },
    "lar": {
      "description": "PHP-фреймворк с открытым исходным кодом",
      "why": "Для чего нужен Laravel ?",
      "full_descr": "Laravel - одна из самых мощных фреймворков PHP, которая обеспечивает быстрый и хорошо организованный процесс веб-разработки и позволяет повторно использовать код. Это помогает создавать более быстрые веб-приложения.<br/> Учебные курсы веб программировании Webex Technologies включают также Laravel."
    },
    "node": {
      "description": "Серверный JavaScript",
      "why": "Для чего нужен Node.js?",
      "full_descr": "Нам нужно использовать Node и NPM, скомпилировать их в файл js, чтобы мы могли развернуть на сервере. Node JS предназначен для создания веб-приложений JavaScript на стороне сервера. Диспетчер пакетов Node сильно зависит от Node. Он предоставляет множество функций, таких как Sockets и поддержка ES6 модулей.<br/> Учебные курсы веб программировании Webex Technologies включают также Node.JS."
    },
    "htaccess": {
      "description": "Файл конфигурации на уровне каталогов",
      "why": "Для чего нужен .htaccess ?",
      "full_descr": "htaccess может быть полезен для блокировки пользователей с определенного IP-адреса (черный список). Это полезно, если вы идентифицировали отдельных пользователей с определенных IP-адресов, которые вызвали проблемы. Вы также можете сделать обратное, заблокировав всех, кроме посетителей, с определенного IP-адреса (белого списка).<br/> Учебные курсы веб программировании Webex Technologies включают также .htaccess"
    },
    "oop": {
      "description": "Объектно-ориентированное программирование",
      "why": "Для чего нужен OOP ?",
      "full_descr": "ООП обеспечивает четкую модульную структуру для программ. Это хорошо для определения абстрактных типов данных. Детали реализации скрыты от других модулей, а другие модули имеют четко определенный интерфейс. Существующий код легко поддерживать и модифицировать, поскольку новые объекты могут создаваться с небольшими отличиями от существующих.<br/> Учебные курсы веб программировании Webex Technologies включают также ООП."
    }
  },
  "homeworks": {
    "video_tasks": "Видео задачи",
    "available_to_registered_users": "Этот раздел доступен только зарегистрированным пользователям.",
    "hworks_are_closed_to_you": "Задания в этом уроке все еще закрыты для вас. <br/> Вы можете связаться с администратором для получения подробной информации."
  }
}