export const advantage = [
  {
    title: "Պրոֆեսիոնալ դասավանդում",
    icon: "book",
    text:
      "Մեզ մոտ դասերը ընթանում են մշակված ծրագրով և մշտապես թարմացվում են` ներառելով իրենց մեջ նորամուծությունները և նոր լուծումները։ Դասընթացը անց ենք կացնում վիդեոդասերի միջոցով` ցուցաբերելով անհատական մոտեցում։",
  },
  {
    title: "Բարձրակարգ մասնագետներ",
    icon: "users",
    text:
      "Մեր մասնագետները մինչև 15 տարվա փորձ ունեն և գործող վեբ ծրագրավորողոներ են։ Նրանք համբերատար կբացատրեն ծրագրավորման նրբությունները և կապացուցեն Ձեզ, որ ծրագրավորման մեջ ոչ մի դժվար բան չկա։",
  },
  {
    title: "Անհատական մոտեցում",
    icon: "laptop",
    text:
      "Մեր առավելությունը նրանում է, որ ուսանողին ցուցաբերում ենք  անհատական մոտեցում։Հաշվի առնելով ուսանողի կարողությունները, մշակում ենք դասավանդման անհատական ծրագիր՝ ուսուցումն ավելի մատչելի դարձնելու համար։",
  },
  {
    title: "Վիդեոդասեր",
    icon: "microphone",
    text:
      "Մենք փորձում ենք մեր դասերը մատչելի դարձնել բոլորի համար՝ ուստի ստեղծել ենք առցանց ծրագրավորում սովորելու հնարավորություն: Այսպիսով՝ ուսանողներին հնարավորություն է ընձեռվում սովորելու ցանկացած վայրում և ցանկացած ժամի։",
  },
  {
    title: "Սերտիֆիկատ",
    icon: "certificate",
    text:
      "Դասերի վերջում տրվում է սերտիֆիկատ, որը հավաստում է, որ Դուք որակավորված մասնագետ եք՝ սակայն պետք է հիշել, որ ինֆորմացիոն տեխնոլոգիաների ոլորտում կարևորը գիտելիքն է։",
  },
  {
    title: "Աշխատանքի տեղավորում",
    icon: "thumbs-up",
    text:
      "Webex-ը օժանդակում է ուսանողներին տեղավորվել աշխատանքի՝ մեզ մոտ կամ գործընկեր կազմակերպություններում։ Ամեն դեպքում՝ ամեն ինչ կախված է ձեզանից, քանի որ աշխատանքի ընդունվելուց առաջ ուսանողները պետք է անցնեն հարցազրույց։",
  },
];
